Revit 2026 API

# RebarConstraintFlipHandleOverTarget Method

---

Flips the RebarConstrainedHandle to the other side of the target bar handle, maintaining the distance in absolute value.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void FlipHandleOverTarget()
```
```vb
Public Sub FlipHandleOverTarget
```
```cpp
public:
void FlipHandleOverTarget()
```
```fsharp
member FlipHandleOverTarget : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- The RebarTargetConstraintType is 'HookBend' or 'BarBend'. |

Throw exception if constraint type is not 'ToOtherRebar', or for constraints involving bar/hook bend handle.

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace